In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('csv/income.csv',names=['name','income'],skiprows=[0])
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [3]:
df.head()

    name  income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000

In [4]:
df.income.describe()

count    7.000000e+00
mean     1.433929e+06
std      3.777283e+06
min      4.000000e+03
25%      5.500000e+03
50%      7.000000e+03
75%      7.750000e+03
max      1.000000e+07
Name: income, dtype: float64

In [5]:
df.income.quantile(0)

4000.0

In [6]:
df.income.quantile(0.25)

5500.0

In [7]:
df.income.quantile(0.75)

7750.0

In [8]:
df.income.quantile(1)

10000000.0

In [10]:
percentile_99 = df.income.quantile(0.99)

In [11]:
df_no_outlier = df[df.income <= percentile_99]

In [12]:
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [15]:
# Making the thrid value as our null value 
df['income'][3] = np.NaN

In [16]:
df

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia         NaN
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [17]:
df.income.mean()

1671666.6666666667

In [18]:
# Here we are filling null values also called as IMPUTATION
df_new = df.fillna(df.income.mean())
df_new
# Here we are performing the MEAN imputation.

        name        income
0        Rob  5.000000e+03
1      Rafiq  6.000000e+03
2       Nina  4.000000e+03
3      Sofia  1.671667e+06
4      Mohan  8.000000e+03
5        Tao  7.000000e+03
6  Elon Musk  1.000000e+07